//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
//	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
//	ПараметрыРегистрации.Наименование = "" + Метаданные().Представление();
//	ПараметрыРегистрации.Версия = "1.1";
//	ПараметрыРегистрации.БезопасныйРежим = Ложь;
//	
//	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
//	НоваяКоманда.Представление = НСтр("ru = '" + Метаданные().Представление()+"'");
//	НоваяКоманда.Идентификатор = Метаданные().ПолноеИмя();
//	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//	
//	Возврат ПараметрыРегистрации;
//	
//КонецФункции